Revit 2022 API
SetupEnergySimulationDialog Members
The SetupEnergySimulationDialog type exposes the following members.
Constructors
Name | Description
SetupEnergySimulationDialog
 Constructs a new instance of the SetupEnergySimulationDialog class.
Methods
Name | Description
Dispose
Releases all resources used by the SetupEnergySimulationDialog
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
Show
 Shows the SetupEnergySimulationDialog to the user as a modal dialog.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
ProjectId
 The identifier of the project (on the Green Building Studio server) that was selected by the user.
ProjectName
 The project name (representing a project on the Green Building Studio server) selected or supplied by the user.
RunName
 The name of the analysis run that was supplied by the user.
See Also
SetupEnergySimulationDialog Class
Autodesk.Revit.UI Namespace